Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/ruby-omegat.tmx
Source language: en_us
Languages: pt_br

source: Scripting language
pt_br: Linguagem de script

source: Java Whitespace
pt_br: Espaço em branco do Java

source: Java Error
pt_br: Erro Java

source: Java Line Comment
pt_br: Linha de comentário Java

source: Java Block Comment
pt_br: Comentário em bloco Java

source: Java Char
pt_br: Char Java

source: Java String
pt_br: String Java

source: Java Number
pt_br: Número Java

source: Text
pt_br: Texto

source: Tag Directive
pt_br: Diretiva de marcação

source: JSP Scriptlet
pt_br: Scriptlet JSP

source: Expression Language
pt_br: Linguagem de expressão

source: Attribute Whitespace
pt_br: Atributo espaço em branco

source: JSP Scriptlet Delimiter
pt_br: Delimitador Scriptlet JSP

source: Java keyword
pt_br: Palavra-chave Java

source: Java Character Literal
pt_br: Caráctere literal Java

source: JSP Attribute Value
pt_br: Valor de atributo JSP

source: JSP Comment
pt_br: Comentário JSP

source: JSP Tag Error
pt_br: Erro de marcação JSP

source: JSP Whitespace
pt_br: Espaço em branco JSP

source: JSP Text
pt_br: Texto JSP

source: JSP Symbol
pt_br: Símbolo JSP

source: JSP Attribute Name
pt_br: Nome de atributo JSP

source: JSP Tag/Directive
pt_br: Marcação/Diretiva JSP

source: Scriplet Delimitier
pt_br: Delimitador Scriplet

source: XML DOCTYPE Declaration
pt_br: Declaração do tipo de documento XML

source: XML Operator
pt_br: Operador XML

source: XML EOL
pt_br: EOL de XML

source: XML CDATA Section
pt_br: Seção CDATA de XML

source: XML Markup Whitespace
pt_br: Espaço em branco XML Markup

source: XML Value
pt_br: Valor XML

source: XML Reference
pt_br: Referência XML

source: XML Error
pt_br: Erro XML

source: XML Attribute
pt_br: Atributo XML

source: XML Tag
pt_br: Marcação XML

source: XML Comment
pt_br: Comentário XML

source: XML Text
pt_br: Texto XML

source: XML PI Start
pt_br: Começo do XML PI

source: XML PI Content
pt_br: Conetúdo do XML PI

source: XML PI Target
pt_br: Destino do XML PI

source: XML PI End
pt_br: Fim do XML PI

source: JSP Formated Text
pt_br: Texto formatado JSP

source: EL EOL
pt_br: EOL EL

source: EL Whitespace
pt_br: Espaço em branco EL

source: EL Scriptlet Delimiter
pt_br: Delimitador EL Scriptlet

source: EL Error In Sources
pt_br: Erro no código-fonte da EL

source: EL Identifier
pt_br: Identificador EL

source: EL function call
pt_br: Chamada de função EL

source: EL Keyword
pt_br: Palavra-chave EL

source: EL Operator
pt_br: Operador EL

source: EL Tag Library Prefix
pt_br: Biblioteca de marcação de prefixo EL

source: EL String Literal
pt_br: String literal EL

source: EL Numeric Literal
pt_br: Número literal EL

source: EL Character Literal
pt_br: Caráctere literal EL

source: EL Operators
pt_br: Operadores EL

source: Ruby Error
pt_br: Erro Ruby

source: Ruby Class Variable
pt_br: Variável de classe Ruby

source: Ruby Regular Expression
pt_br: Expressão regular Ruby

source: Ruby Line Comment
pt_br: Comentário em linha Ruby

source: Ruby Constant
pt_br: Constante Ruby

source: Ruby Number
pt_br: Número Ruby

source: Ruby Identifier
pt_br: Identificador Ruby

source: Ruby Keyword
pt_br: Palavra-chave Ruby

source: Ruby Whitespace
pt_br: Espaço em branco Ruby

source: Ruby Floating point number
pt_br: Número de ponto flutuante Ruby

source: Ruby Operator
pt_br: Operador Ruby

source: Ruby Instance
pt_br: Instância Ruby

source: Ruby Invalid String
pt_br: String inválida Ruby

source: Ruby Global Variable
pt_br: Variável global Ruby

source: Ruby Todo Item
pt_br: Item afazer Ruby

source: Ruby String
pt_br: String Ruby

source: Ruby Double
pt_br: Double Ruby

source: Ruby Block Comment
pt_br: Comentário em bloco Ruby

source: Ruby Quoted String
pt_br: String citada Ruby

source: Ruby Long
pt_br: Long Ruby

source: Ruby String Escape
pt_br: String de escape Ruby

source: Ruby Character Literal
pt_br: Caractere literal Ruby

source: Ruby Documentation
pt_br: Documentação Ruby

source: Comment Text
pt_br: Texto de comentário

source: Comment TODO Text
pt_br: Texto de comentário TODO

source: RDoc Comment Tag
pt_br: Marcação de comentário RDoc

source: Comment HTML Tag
pt_br: Marcação de comentário HTML

source: Comment Link
pt_br: Link de comentário

source: Bold Comment
pt_br: Comentário negrito

source: Italic Comment
pt_br: Comentário itálico

source: Regular Expression Metachar
pt_br: Metacaractere para expressão regular

source: Invalid Regular Expression
pt_br: Expressão regular inválida

source: &lt;% rubycode %&gt;
pt_br: &lt;% codigo_ruby %&gt;

source: &lt;%= expression %&gt;
pt_br: &lt;%= expressao %&gt;

source: Hash Pair :key =&gt; "value"
pt_br: Par de hash :key =&gt; "valor"

source: Embedded Ruby (RHTML) Files
pt_br: Arquivos Ruby embarcados (RHTML)

source: RHTML Editor
pt_br: Editor RHTML

source: Rake-Based Project Support
pt_br: Suporte para projetos baseados no Rake

source: Supports all project types based on Ant as a build tool.
pt_br: Oferece suporte a todos os tipos de projetos baseados no Ant como ferramenta de build.

source: Provides infrastructure and APIs for project types using the regular file layout and presumably doing Ant-based builds.
pt_br: Fornece infra-estrutura e APIs para tipos de projetos que utilizam a organização de arquivos padrão e que presumivelmente fazem builds baseados no Ant.

source: Cannot Write to File
pt_br: Não é possível escrever no arquivo

source: Error parsing {0}: {1}
pt_br: Erro analisando {0}: {1}

source: An incompatible Xalan version has been detected on the IDE's classpath.
pt_br: Foi detectada uma versão incompatível do Xalan no classpath do IDE.

source: The IDE cannot start.
pt_br: O IDE não pôde ser iniciado.

source: Please see http://wiki.netbeans.info/wiki/view/FaqXalanOnCP for more information.
pt_br: Por favor veja http://wiki.netbeans.info/wiki/view/FaqXalanOnCP (em inglês) para maiores informações.

source: This file is used by a NetBeans-based IDE to track changes in generated files such as build-impl.xml.
pt_br: Este arquivo é utilizado pelo IDE NetBeans para rastrear mudanças nos arquivos gerados como o build-impl.xml.

source: Do not edit this file.
pt_br: Não edite este arquivo.

source: You may delete it but then the IDE will never regenerate such files for you.
pt_br: Você pode excluí-los, mas o IDE não irá gerá-los novamente para você.

source: Library acts as intermediate between debug-commons (Ruby debugging backend) and the NetBeans Ruby Debugger module (frontend).
pt_br: A biblioteca atua como intermediadora entre o debug-commons (Ruby debugging backend) e o módulo NetBeans Ruby Debugger (frontend).

source: debug-commons-java integration
pt_br: integração debug-commons-java

source: Integration of debug-commons-java library
pt_br: Integração da biblioteca debug-commons-java

source: Ruby JavaHelp Content For NetBeans
pt_br: Conteúdo da ajuda do Ruby para NetBeans

source: Online help pages for the IDE's Ruby support
pt_br: Páginas de ajuda online para suporte Ruby do IDE

source: Contains the actual JavaHelp content files for the Ruby Support
pt_br: Contém os arquivos JavaHelp para suporte a Ruby

source: JRuby and Rails Distribution
pt_br: Distribuição JRuby and Rails

source: Bundled distribution of JRuby and Ruby on Rails
pt_br: Distribuição embutida do JRuby and Ruby on Rails

source: Bundled distribution of JRuby 1.0 and Ruby on Rails 1.2.3
pt_br: Distribuição embutida do JRuby 1.0 and Ruby On Rails 1.2.3

source: Breakpoint
pt_br: Ponto de interrupção

source: Call Stack Line
pt_br: Linha na chamada da pilha

source: Conditional Breakpoint
pt_br: Ponto de interrupção condicional

source: Current Program Counter
pt_br: Contador do programa atual

source: Current Target
pt_br: Destino atual

source: Disabled Breakpoint
pt_br: Ponto de interrupção desabilitado

source: Disabled Conditional Breakpoint
pt_br: Ponto de interrupção condicional desabilitado

source: Ruby Debugger
pt_br: Depurador Ruby

source: Ruby Debugger configuration
pt_br: Configuração do depurador Ruby

source: Browse rdebug executable
pt_br: Procurar depurador executável

source: &Classic Debugger
pt_br: Depurador &clássico

source: Debugger engine:
pt_br: Mecanismo de depuração:

source: <html>Note: The <em>Fast Debugger</em> cannot be used with JRuby interpreter.</html>
pt_br: <html>Aviso: O <em>Fast Debugger</em> não pode ser utilizado com o interpretador JRuby.</html>

source: <html>You have to select executable named <em>{0}</em></html>
pt_br: <html>Você tem que selecionar o executável nomeado como <em>{0}</em></html>

source: <html><b>Fast Debugger</b> is required to debug this kind of application.
pt_br: <html><b>Fast Debugger</b> é obrigatório para depurar este tipo de aplicação.

source: Do you want to install it now?</html>
pt_br: Você deseja instalá-lo agora?</html>

source: Fast Debugger gem (ruby-debug-ide) seems to be corrupted for "{0}" interpreter (cannot find "{1}" executable).
pt_br: Fast Debugger gem (ruby-debug-ide) parece estar corrompido no interpretador "{0}" (Não conseguiu encontrar o executável "{1}").

source: Please try to reinstall it in the Menu -> Tools -> Ruby Gems.
pt_br: Por favor, tente reinstalar a partir de: Menu -> Ferramentas -> Ruby Gems.

source: <html>You have set the <em>Fast Debugger</em> and <em>JRuby</em> interpreter.However Fast Debugger does not work with JRuby.<br>(You may change Ruby setting in the Tools -> Options -> Ruby)<br><br>Do you want to continue with Classic Debugger?</html>
pt_br: <html>Você definiu <em>Fast Debugger</em> e o interpretador <em>JRuby</em>. Entretanto o o Fast Debugger não funciona com o JRuby.<br>(Você pode alterar as configurações Ruby em Ferramentas -> Opções -> Ruby)<br><br>Você deseja continuar com o Classic Debugger?</html>

source: Problem occurred during debugger start: {0}
pt_br: Ocorreu um problema enquanto iniciava o depurador: {0}

source: <html>For debugging applications under native Ruby interpreter, the <b>Fast Debugger</b>, which is available as a gem, may be used.
pt_br: <html>Para depurar aplicações sobre o interpretador nativo Ruby, o <b>Fast Debugger</b>, que está disponível pelo Gem, pode ser usado.

source: Do you want to install it now or continue with the default (slow) debugger?</html>
pt_br: Você deseja instalá-lo agora ou continuar com o depurador padrão (lento)?</html>

source: <html>The <b>Fast Debugger</b> option was selected, but the <b>ruby-debug-ide-{0}</b> gem, which is needed to get Fast Debugger working, is not installed.
pt_br: <html>A opção <b>Fast Debugger</b> foi selecionada, mas o <b>ruby-debug-ide-{0}</b> gem, que é preciso para deixar o Fast Debugger trabalhando, não está instalado.

source: <html>This kind of application cannot be debugged under the <em>JRuby</em> interpreter.
pt_br: <html>Este tipo de aplicação não pode ser depurada sobre o interpretador <em>JRuby</em>.

source: You may change your interpreter in the Tools -> Options -> Ruby.</html>
pt_br: Você deve alterar seu interpretador em: Ferramentas -> Opções -> Ruby.</html>

source: Fast Debugger installation
pt_br: Instalação do Fast Debugger

source: Install Fast Debugger
pt_br: Instalar o Fast Debugger

source: Continue
pt_br: Continuar

source: Fast debugger installation failed.
pt_br: A instalação do Fast Debugger falhou.

source: Do not ask again
pt_br: Não perguntar novamente

source: Slow debugger engine
pt_br: Mecanismo de depuração lento

source: Fast debugger engine
pt_br: Mecanismo Fast Debugger

source: Install fast debugger gem
pt_br: Instalar fast debugger gem

source: Provides Ruby Debugger support for NetBeans.
pt_br: Fornece suporte para depurar Ruby no NetBeans.

source: You might want to take a look at http://wiki.netbeans.org/wiki/view/RubyDebugging for more information, e.g. how to set up fast debugging support.
pt_br: Você pode querer dar uma olhada em http://wiki.netbeans.org/wiki/view/RubyDebugging para maiores informações, ex.: como definir o suporte para o fast debugging.

source: Go To Source
pt_br: Ir para o código-fonte

source: Name of stack frame
pt_br: Nome do quadro de pilha

source: Name
pt_br: Nome

source: Running
pt_br: Executando

source: Starting
pt_br: Inicializando

source: Stopped
pt_br: Parado

source: Thread name
pt_br: Nome da Thread

source: Name of local variable
pt_br: Nome da variável local

source: Global Variables
pt_br: Variáveis globais

source: Watch expression
pt_br: Expressão para observação

source: "<Unknown in the current context>"
pt_br: "<Desconhecido no contexto atual>"

source: Libraries
pt_br: Bibliotecas

source: kxml2 integration
pt_br: integração kxml2

source: XML Pull Parser implementation
pt_br: implementação XML Pull Parser

source: Missing Ruby
pt_br: Faltando Ruby

source: No valid installation of "{0}".
pt_br: Nenhuma instalação válida em "{0}".

source: Install one with the Gem Manager or configure a different Ruby interpreter.
pt_br: Instale com o Gerenciador Gem ou configure um interpretador Ruby diferente.

source: Configure it under options | Ruby | Platform
pt_br: Configure em: Opções | Ruby | Plataforma

source: No valid installation of a Ruby interpreter.
pt_br: Nenhuma instalação válida do interpretador Ruby.

source: Configure one under options | Ruby | Platform
pt_br: Configure em: Opções | Ruby | Plataforma

source: Options...
pt_br: Opções...

source: Choose Ruby Interpreter
pt_br: Escolha um interpretador Ruby

source: Other...
pt_br: Outro...

source: JRuby (bundled with the IDE)
pt_br: JRuby (embarcado no IDE)

source: Native Ruby:
pt_br: Ruby nativo:

source: Which Ruby interpreter do you want to use?
pt_br: Qual interpretador Ruby você deseja utilizar?

source: You can change this setting later in the Options dialog
pt_br: Você pode modificar esta configuração posteriormente no diálogo de opções

source: Built-in JRuby (1.0.2)
pt_br: JRuby (1.0.1) embutido

source: {0} in {1}
pt_br: {0} em {1}

source: Ruby Platform
pt_br: Plataforma Ruby

source: Infrastructure and APIs for configuring and searching Ruby platforms.
pt_br: Infra-estrutura e APIs para configurar e pesquisar plataformas Ruby.

source: Provides APIs and a storage mechanism for configuration of different Ruby platforms, such as JRuby and native Ruby.
pt_br: Fornece APIs e um mecanismo de armazenamento para configuração de diferentes plataformas Ruby, como por exemplo JRuby e Ruby nativo.

source: Ruby Refactoring
pt_br: Refatoração do Ruby

source: The original element being refactored is not available.
pt_br: O elemento original o qual você está tentando refatorar não está disponível.

source: It was deleted or significantly changed.
pt_br: Este foi excluído ou alterado significativamente.

source: Usages cannot be collected.
pt_br: Utilizações não podem ser coletadas.

source: Cannot refactor unresolved elements
pt_br: Impossível refatorar elementos não resolvidos

source: Cannot refactor code that is defined outside of an open project.
pt_br: Não é possível refatorar o código que está definido fora de um projeto aberto.

source: Cannot rename this type of object.
pt_br: Impossível renomear este tipo de objeto.

source: Ruby package, method, field or class has to be selected.
pt_br: Pacote Ruby, método, campo ou classe deve estar selecionado.

source: This method overrides or implements methods in super classes/interfaces.
pt_br: Este método sobrescreve ou implementa métodos em super classes/interfaces.

source: They will also be renamed.
pt_br: Eles também serão renomeados.

source: This method overrides or implements methods in super classes/interfaces, so its name cannot be changed.
pt_br: Este método substitui ou implementa métodos em super classes/interfaces, entretanto este nome não pode ser alterado.

source: This method overrides or implements a method in {0}.
pt_br: Este método sobrescreve ou implementa um método em {0}.

source: This method is also overridden or implemented in {1}.
pt_br: Este método também é sobrescrito ou implementado em {1}.

source: If you really want to perform this operation, invoke it on the method in {2}.
pt_br: Se você realmente deseja executar esta operação, chame-a no método em {2}.

source: There are methods in subclasses/implementors of {0} that override or implement this method.
pt_br: Existem métodos em subclasses/implementações de {0} que substituem ou implementam este método.

source: After renaming, the original method "{0}" in {1} will be overridden by method "{2}" in {3}.
pt_br: Depois de renomear, o método original "{0}" em {1} será substituído por "{2}" em {3}.

source: After renaming, the original method {0} in {1} will be overridden by method "{2}" in {3} with weaker access privileges.
pt_br: Depois de renomear, o método original {0} em {1} será substituído por "{2}" em {3} com menores privilégios de acesso.

source: After renaming, the original {0} method "{1}" in {2} will be overridden by {3} method "{4}" in {5}.
pt_br: Depois de renomear, o método {0} original "{1}" em {2} será substituído pelo {3} método "{4}" em {5}.

source: After renaming, the original final method "{0}" in {1} will be overridden by method "{2}" in {3}.
pt_br: Depois de renomear, o método original final "{0}" em {1} será substituído por "{2}" em {3}.

source: After renaming, method "{0}" in {1} will override the original method "{2}" in {3}.
pt_br: Depois de renomear, o método "{0}" em {1} irá substituir o método original "{2}" em {3}.

source: After renaming, method {0} in {1} will override the original method "{2}" in {3} with stronger access privileges.
pt_br: Depois de renomar, o método {0} em {1} irá substituir o método original "{2}" em {3} com maiores privilégios de acesso.

source: After renaming, {0} method "{1}" in {2} will override the original {3} method "{4}" in {5}.
pt_br: Depois de renomear, {0} método "{1}" em {2} irá substituir o original {3} método "{4}" em {5}.

source: After renaming, method "{0}" in {1} will override the original final method "{2}" in {3}.
pt_br: Depois de renomear, método "{0}" em {1} irá substituiro método original final "{2}" em {3}.

source: The name has not been modified.
pt_br: O nome não foi modificado.

source: No changes will be performed.
pt_br: Nenhuma alteração será executada.

source: "{0}" is not a valid Ruby identifier.
pt_br: "{0}" não é um identificador Ruby válido.

source: "{0}" is not a valid Ruby class name.
pt_br: "{0}" não é um nome de classe Ruby válida.

source: "{0}" is not a valid Ruby method name.
pt_br: "{0}" não é um nome de método Ruby válido.

source: "{0}" is not a valid package identifier.
pt_br: "{0}" não é um identificador de pacote válido.

source: Package "{0}" already exists.
pt_br: O pacote "{0}" já existe.

source: Cannot rename.
pt_br: Impossível renomear.

source: Inner class {0} already exists in class {1}.
pt_br: Classe interna {0} já existe na classe {1}.

source: Class {0} already exists in folder {1}.
pt_br: Classe {0} já existe na pasta {1}.

source: Method {0} with the same signature already exists in class {1}.
pt_br: O método {0} com a mesma assinatura já existe na classe {1}.

source: Field {0} already exists in class {1}.
pt_br: O campo {0} já existe na classe {1}.

source: {0} already used.
pt_br: {0} já está em uso.

source: The field to be renamed hides a field in {0}.
pt_br: O campo a ser renomeado esconde o campo em {0}.

source: The new field will hide a field in {0}.
pt_br: O novo campo irá esconder um campo em {0}.

source: The name has not been specified.
pt_br: O nome não foi especificado.

source: Cannot move class(es) into the same package.
pt_br: Impossível mover classe(s) dentro do mesmo pacote.

source: Cannot rename element in library file: "{0}".
pt_br: Impossível renomear elemento no arquivo biblioteca: "{0}".

source: Cannot rename method "{0}".
pt_br: Impossíve renomear método "{0}".

source: Source file "{1}" not available.
pt_br: Arquivo de origem "{1}" não está disponível.

source: Cannot search for usages of this type of object.
pt_br: Não é possível pesquisar por utilizações deste tipo de objeto.

source: A Ruby element has to be selected.
pt_br: Um elemento Ruby não foi selecionado.

source: A target package has not been specified.
pt_br: Um pacote alvo não foi especificado.

source: Selected source does not contain any class.
pt_br: Código-fonte selecionado não possui nenhuma classe.

source: You can not move a class from a source file that contains multiple top-level classes.
pt_br: Você não pode mover uma classe de um arquivo de origem que contenha múltiplas classes de nível superior.

source: Class "{0}" within the same package is using {1} {2} "{3}" of class you want to move ("{4}").
pt_br: A classe "{0}" dentro do mesmo pacote está utilizando {1} {2} "{3}" da classe que você deseja mover ("{4}").

source: Class "{0}" within the same package is using {1} class you want to move ("{2}").
pt_br: A classe "{0}" dentro do mesmo pacote está utilizando a classe {1} que você deseja mover ("{2}").

source: Class "{0}" within the same package is using {1} constructor declared in class you want to move ("{2}").
pt_br: A classe "{0}" dentro do mesmo pacote está utilizando o construtor {1} declarado na classe que você deseja mover ("{2}").

source: Class you want to move ("{0}") is using {1} {2} "{3}" of class "{4}" within the same package.
pt_br: A classe que você deseja mover ("{0}") está utilizando {1} {2} "{3}" da classe "{4}" dentro do mesmo pacote.

source: Class you want to move ("{0}") is using {1} class ("{2}") within the same package.
pt_br: A classe que você deseja mover ("{0}") está utilizando a classe {1} ("{2}") dentro do mesmo pacote.

source: Class you want to move ("{0}") is using {1} constructor declared in class ("{2}") within the same package.
pt_br: A classe que você deseja mover ("{0}") está utilizando o construtor {1} declarado na classe ("{2}") dentro do mesmo pacote.

source: Package "{0}" is read only.
pt_br: O pacote "{0}" é somente leitura.

source: Class "{0}" already exists in the target package.
pt_br: A classe "{0}" já existe no pacote destino.

source: After the move, it will not be possible to import classes in the original default package.
pt_br: Depois de mover, não será possível importar classes no pacote padrão original.

source: If the class is moved to the default package, classes in other packages will not be able to import the moved class.
pt_br: Se a classe é movida para o pacote padrão, classes em outros pacotes serão inabilitadas de importar as classes movidas.

source: File {0} already exists in package {1}.
pt_br: O arquivo {0} já existe no pacote {1}.

source: The parent package has been selected as the destination.
pt_br: O pacote pai foi selecionado como destino.

source: There are no changes to be performed.
pt_br: Não existe alteração para ser executada.

source: A package cannot be moved into one of its subpackages or into itself.
pt_br: Um pacote não pode ser movido dentro de um destes subpacotes ou dentro dele mesmo.

source: Default package cannot be moved.
pt_br: Pacote padrão não pode ser movido.

source: Cannot move file from library: "{0}".
pt_br: Impossível mover arquivo da biblioteca: "{0}".

source: The method overrides or implements methods in super classes/interfaces.
pt_br: O método sobrescreve ou implementa métodos em super classes/interfaces.

source: There are methods in subclasses or implementors of {0} that override or implement the method.
pt_br: Existem métodos em subclasses ou implementações de {0} que substituem ou implementam o método.

source: You cannot use the Change Method Parameters refactoring on methods with variable arguments.
pt_br: Você não pode utilizar a refatoração Alterar parâmetros do método em métodos com argumentos variáveis.

source: You have to provide {0} for all new parameters.
pt_br: Você deve fornecer {0} para todos os novos parâmetros.

source: parameter name
pt_br: nome do parâmetro

source: parameter type
pt_br: tipo do parâmetro
